# GetMrEm2DCompByStyle

```pascal
FUNCTION GetMrEm2DCompByStyle(hObject : HANDLE): BOOLEAN;
```

```python
def vs.GetMrEm2DCompByStyle(hObject):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObject|HANDLE|   |

## Version
Availability: from Vectorworks 2020

## Category
* Objects - Custom